Конфигурация/DataProcessors/ПечатьЗаявокНаПроплатуНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьЗаявокНаПроплатуНалога</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ИФНСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИФНСОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоКрупнейшимНалогоплательщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВоВнешнихСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВоВнешнихСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДопКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИмпортируемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ОснованияРасчетаНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ОснованияРасчетаНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыводАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонецНалоговогоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводАктивовДругомуПрофучастнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасторжениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаНаследнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/ПечатьЗаявокНаПроплатуНалога/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьСведенияОбОплатах()
	
	 // поле ПечСубСчет 
	 // СубСчет открывается в дополнение к основному. Субсчет может быть у расчетного счета, у корсчета.
	 // Субсчетов может быть несколько и пока непонятно как их хранить. 
	 // В запрос забит субсчет для платежей в бюждет УФК по г. Москве.
		
	Если ЭтаФорма.ВидСобытия = "Оплата налога по расчету НДФЛ" Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст  = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОбороты.РасчетныйСчет КАК РасчетныйСчет,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Регистратор КАК ДокументОплата,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход КАК Сумма,
		|	ИФНСОрганизацийСрезПоследних.ИФНС КАК Получатель,
		|	ИФНСОрганизацийСрезПоследних.БанковскийСчет КАК БанковскийСчетПолучатель,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицСрезПоследних.КПП2 = """"
		|			ТОГДА РеквизитыЮридическихЛицСрезПоследних.КПП
		|		ИНАЧЕ РеквизитыЮридическихЛицСрезПоследних.КПП2
		|	КОНЕЦ КАК КПП
		|ПОМЕСТИТЬ _Оплаты
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Организация = &Организация
		|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Организация = &Организация) КАК ОстаткиДенежныхСредствОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&ДатаОкончания, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО ОстаткиДенежныхСредствОбороты.РасчетныйСчет.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Регистратор = ОстаткиДенежныхСредствОбороты.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = НачислениеЗадолженностиОснования.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетНДФЛ КАК РасчетНДФЛ
		|		ПО (РасчетНДФЛ.Ссылка = НачислениеЗадолженностиОснования.Основание),
		|	РегистрСведений.ИФНСОрганизаций.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И НЕ ПоКрупнейшимНалогоплательщикам) КАК ИФНСОрганизацийСрезПоследних
		|ГДЕ
		|	РасчетНДФЛ.ОснованиеРасчета <> ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ВыплатаДивидендов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Оплаты.РасчетныйСчет КАК РасчетныйСчет,
		|	_Оплаты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Оплаты.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	_Оплаты.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	_Оплаты.ДокументОплата КАК ДокументОплата,
		|	_Оплаты.ДокументОплата.Дата КАК ПечДатаПроплаты,
		|	_Оплаты.Сумма КАК Сумма,
		|	РеквизитыЮридическихЛицПолучатель.ПолноеНаименованиеПоУставу КАК ПечПолучатель,
		|	ВЫБОР
		|		КОГДА &ДатаНачала > ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
		|			ТОГДА РеквизитыЮридическихЛицПолучатель.ИНН + ""/КПП "" + РеквизитыЮридическихЛицПолучатель.КПП
		|		ИНАЧЕ РеквизитыЮридическихЛицПолучатель.ИНН
		|	КОНЕЦ КАК ПечИНН,
		|	_Оплаты.БанковскийСчетПолучатель.НомерСчета КАК ПечРасчСчет,
		|	""03100643000000017300"" КАК ПечСубСчет,
		|	_Оплаты.БанковскийСчетПолучатель.Банк.Код КАК ПечБИК,
		|	_Оплаты.БанковскийСчетПолучатель.Банк.Наименование КАК ПечБанкПолучателя,
		|	_Оплаты.БанковскийСчетПолучатель.Банк.КоррСчет КАК ПечКоррСчет,
		|	ВЫБОР
		|		КОГДА &ДатаНачала < ДАТАВРЕМЯ(2026, 4, 1)
		|			ТОГДА _Оплаты.РасчетныйСчет.Наименование + "" КПП "" + _Оплаты.КПП
		|		ИНАЧЕ _Оплаты.РасчетныйСчет.Наименование
		|	КОНЕЦ КАК ПечБанк,
		|	РеквизитыЮридическихЛицПолучатель.КодПоОКТМО КАК ПечОКТМО,
		|	_Оплаты.ДокументОплата.ВидЗадолженности КАК ВидЗадолженности
		|ИЗ
		|	_Оплаты КАК _Оплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&ДатаОкончания, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицПолучатель
		|		ПО _Оплаты.Получатель = РеквизитыЮридическихЛицПолучатель.ЮрФизЛицо
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	РасчетныйСчет,
		|	ВидЗадолженности";
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Дата));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Дата));
				
		
	ИначеЕсли ЭтаФорма.ВидСобытия = "Оплата налога с дивидендов" Тогда      
		
		Запрос = Новый Запрос;
		
		Запрос.Текст  = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОплатаНалога.Ссылка.РасчетныйСчет КАК РасчетныйСчет,
		|	ОплатаНалога.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОплатаНалога.Ссылка КАК ДокументОплата,
		|	ОплатаНалога.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ОплатаНалога.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
		|			ТОГДА ИФНСОрганизацийНДФЛ.ИФНС
		|		ИНАЧЕ ЕСТЬNULL(ИФНСОрганизацийПоКрупнейшим.ИФНС, ИФНСОрганизацийНДФЛ.ИФНС)
		|	КОНЕЦ КАК Получатель,
		|	ВЫБОР
		|		КОГДА ОплатаНалога.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
		|			ТОГДА ИФНСОрганизацийНДФЛ.БанковскийСчет
		|		ИНАЧЕ ЕСТЬNULL(ИФНСОрганизацийПоКрупнейшим.БанковскийСчет, ИФНСОрганизацийНДФЛ.БанковскийСчет)
		|	КОНЕЦ КАК БанковскийСчетПолучатель,
		|	ВЫБОР
		|		КОГДА ОплатаНалога.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
		|			ТОГДА ВЫБОР
		|					КОГДА РеквизитыЮридическихЛицСрезПоследних.КПП2 = """"
		|						ТОГДА РеквизитыЮридическихЛицСрезПоследних.КПП
		|					ИНАЧЕ РеквизитыЮридическихЛицСрезПоследних.КПП2
		|				КОНЕЦ
		|		ИНАЧЕ РеквизитыЮридическихЛицСрезПоследних.КПП
		|	КОНЕЦ КАК КПП
		|ПОМЕСТИТЬ _Оплаты
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Период,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.НРД)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.КорпоративноеСобытиеПоВыплатеДивидендов)
		|				И Код = &ИдСобытия) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК НачислениеДивидендов
		|		ПО КодыВоВнешнихСистемахСрезПоследних.Объект = НачислениеДивидендов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаДивидендов
		|		ПО (НачислениеДивидендов.Ссылка = ОплатаДивидендов.Основание)
		|			И (ОплатаДивидендов.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетНДФЛ.Основания КАК РасчетНДФЛОснования
		|		ПО (РасчетНДФЛОснования.Основание = ОплатаДивидендов.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
		|		ПО (НачислениеЗадолженностиОснования.Основание = РасчетНДФЛОснования.Ссылка)
		|			И (НЕ НачислениеЗадолженностиОснования.Ссылка.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаНалога
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ПО ОплатаНалога.Ссылка.РасчетныйСчет.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ПО (&СтруктураЗависимости2025
		|					И НачислениеЗадолженностиОснования.Ссылка = ОплатаНалога.Основание
		|				ИЛИ НЕ &СтруктураЗависимости2025
		|					И НачислениеДивидендов.Ссылка = ОплатаНалога.Основание)
		|			И (ОплатаНалога.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ15)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИФНСОрганизаций.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И НЕ ПоКрупнейшимНалогоплательщикам) КАК ИФНСОрганизацийНДФЛ
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИФНСОрганизаций.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ПоКрупнейшимНалогоплательщикам) КАК ИФНСОрганизацийПоКрупнейшим
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НачислениеДивидендов.Организация = &Организация
		|	И НачислениеДивидендов.ЦеннаяБумага = &ЦеннаяБумага
		|	И ОплатаНалога.Ссылка.Проведен = ИСТИНА
		|	И НАЧАЛОПЕРИОДА(ОплатаНалога.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Оплаты.РасчетныйСчет КАК РасчетныйСчет,
		|	_Оплаты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Оплаты.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	_Оплаты.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	_Оплаты.ДокументОплата КАК ДокументОплата,
		|	_Оплаты.ДокументОплата.Дата КАК ПечДатаПроплаты,
		|	_Оплаты.Сумма КАК Сумма,
		|	РеквизитыЮридическихЛицПолучатель.ПолноеНаименованиеПоУставу КАК ПечПолучатель,
		|	ВЫБОР
		|		КОГДА &Период > ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
		|			ТОГДА РеквизитыЮридическихЛицПолучатель.ИНН + ""/КПП "" + РеквизитыЮридическихЛицПолучатель.КПП
		|		ИНАЧЕ РеквизитыЮридическихЛицПолучатель.ИНН
		|	КОНЕЦ КАК ПечИНН,
		|	_Оплаты.БанковскийСчетПолучатель.НомерСчета КАК ПечРасчСчет,
		|	""03100643000000017300"" КАК ПечСубСчет,
		|	_Оплаты.БанковскийСчетПолучатель.Банк.Код КАК ПечБИК,
		|	_Оплаты.БанковскийСчетПолучатель.Банк.Наименование КАК ПечБанкПолучателя,
		|	_Оплаты.БанковскийСчетПолучатель.Банк.КоррСчет КАК ПечКоррСчет,
		|	ВЫБОР
		|		КОГДА &Период < ДАТАВРЕМЯ(2026, 4, 1)
		|			ТОГДА _Оплаты.РасчетныйСчет.Наименование + "" КПП "" + _Оплаты.КПП
		|		ИНАЧЕ _Оплаты.РасчетныйСчет.Наименование
		|	КОНЕЦ КАК ПечБанк,
		|	РеквизитыЮридическихЛицПолучатель.КодПоОКТМО КАК ПечОКТМО,
		|	_Оплаты.ДокументОплата.ВидЗадолженности КАК ВидЗадолженности
		|ИЗ
		|	_Оплаты КАК _Оплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицПолучатель
		|		ПО _Оплаты.Получатель = РеквизитыЮридическихЛицПолучатель.ЮрФизЛицо
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	РасчетныйСчет,
		|	ВидЗадолженности";  
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтаФорма.ЦеннаяБумага);
		Запрос.УстановитьПараметр("ИдСобытия", ЭтаФорма.ИдСобытия);
		Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата));  
		Если Объект.Дата < Дата(2025, 1, 1) Тогда                        
			// Начисление Дивидендов
			//  |_ Оплата Дивидендов
			//  |_ Начисление задолженности по НДФЛ
			//  |_ Оплата НДФЛ
			
			Запрос.УстановитьПараметр("СтруктураЗависимости2025", Ложь);  
		Иначе  
			// новая структура подчиненности с 2025 г.  
			// Начисление Дивидендов
			//  |_ Оплата Дивидендов
			//    |_ Расчет НДФЛ
			//      |_ Начисление задолженности по НДФЛ
			//        |_ Оплата НДФЛ           
			
			Запрос.УстановитьПараметр("СтруктураЗависимости2025", Истина);  
		КонецЕсли;	
		
		//в реквизитах физлиц, если налогоплательшик крупнейший, первым идет КПП по крупнейщим, КПП2 для прочих платежей
		// у не крепнейших заполнен только КПП. все платежи на него. 
		// если у организации нет ИФНС по крупнейшим, берем то что есть. 
		
		
	Конецесли;		
			
	Выгрузка = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	ЗначениеВРеквизитФормы(Выгрузка, "Оплаты");
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаСервере
Функция СформироватьНазначение(Сумма, РеквизитыПлатежа)
	
	МесяцОплаты = Формат(РеквизитыПлатежа.ПечДатаПроплаты, "ДФ=ММ.гггг");
	
	Если  РеквизитыПлатежа.ДокументОплата.Дата >= Дата(2026, 4, 1) Тогда 
		
		ТекстНазначение = "18201061201010000510; 0; 0; 0; 0; 0; 
		|ЕНП";	
			
	ИначеЕсли  РеквизитыПлатежа.ДокументОплата.Дата >= Дата(2023, 1, 1) Тогда 
		Если ЭтаФорма.ВидСобытия = "Оплата налога с дивидендов"   Тогда 
			Если РеквизитыПлатежа.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ13 Тогда 
				СтрокаШаблон = "18201061201010000510; 0; 0; 0; 0; 0; 
				|Единый налоговый платеж. НДФЛ по доходам физ. лиц - учредителей ДУ с дивидендов по акциям %1, налог - %2 руб. удержан, как налоговый агент по Договорам Д.У. Без НДС";	
				
				ТекстНазначение = СтрШаблон(СтрокаШаблон, ЭтаФорма.ЦеннаяБумага, Сумма);				
			ИначеЕсли РеквизитыПлатежа.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаПрибыль Тогда	
				СтрокаШаблон = "18201061201010000510; 0; 0; 0; 0; 0; 
				|Единый налоговый платеж. Налог на прибыль организаций с доходов, полученных в виде дивидендов от Российских организаций %1 за %2, налог удержан %3, как налоговый агент по договору Д.У. %4.";
			
				МесяцОплатыПрописью = Нрег(Формат(РеквизитыПлатежа.ПечДатаПроплаты, "ДФ=ММММ гггг")) + " г.";
				СтрокаДоговор = РеквизитыПлатежа.НомерДоговора + " от " + Формат(РеквизитыПлатежа.ДатаЗаключения, "ДФ=dd.MM.yyyy");
				ТекстНазначение = СтрШаблон(СтрокаШаблон,  ЭтаФорма.ЦеннаяБумага, МесяцОплатыПрописью, Сумма, СтрокаДоговор);				
				
			КонецЕсли;
		ИначеЕсли ЭтаФорма.ВидСобытия = "Оплата налога по расчету НДФЛ"  Тогда
			СтрокаШаблон = "18201061201010000510; 0; 0; 0; 0; 0; 
			|Единый налоговый платеж. НДФЛ по доходам физ. лиц - учредителей доверительного управления, налог - %1 руб. удержан, как налоговый агент по Договорам Д.У. Без НДС";	
			
			ТекстНазначение = СтрШаблон(СтрокаШаблон,  Сумма);							
		КонецЕсли;
	Иначе		
		Если ЭтаФорма.ВидСобытия = "Оплата налога с дивидендов"   Тогда 
			Если РеквизитыПлатежа.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ13 Тогда 
				СтрокаШаблон = "18210102010011000110; %1; ТП; МС.%2;0; НС; 
				|НДФЛ по доходам физ. лиц - учредителей ДУ с дивидендов по акциям %3, налог - %4 руб. удержан, как налоговый агент по Договорам Д.У. Без НДС";	
				
				ТекстНазначение = СтрШаблон(СтрокаШаблон, РеквизитыПлатежа.ПечОКТМО, МесяцОплаты, ЭтаФорма.ЦеннаяБумага, Сумма);
			ИначеЕсли РеквизитыПлатежа.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаПрибыль Тогда	
				СтрокаШаблон = "18210101040011000110;%1;ТП; МС.%2;0; НС 
				|Налог на прибыль организаций с доходов, полученных в виде дивидендов от Российских организаций %3 за %4, налог удержан %5, как налоговый агент по договору Д.У. %6.";
				
				МесяцОплатыПрописью = Нрег(Формат(РеквизитыПлатежа.ПечДатаПроплаты, "ДФ=ММММ гггг")) + " г.";
				СтрокаДоговор = РеквизитыПлатежа.НомерДоговора + " от " + Формат(РеквизитыПлатежа.ДатаЗаключения, "ДФ=dd.MM.yyyy");
				ТекстНазначение = СтрШаблон(СтрокаШаблон, РеквизитыПлатежа.ПечОКТМО, МесяцОплаты, ЭтаФорма.ЦеннаяБумага, МесяцОплатыПрописью, Сумма, СтрокаДоговор);
			КонецЕсли;
		ИначеЕсли ЭтаФорма.ВидСобытия = "Оплата налога по расчету НДФЛ"  Тогда
			Если РеквизитыПлатежа.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ13 Тогда 
				СтрокаКБК = "18210102010011000110";
			ИначеЕсли РеквизитыПлатежа.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНДФЛ15 Тогда
				СтрокаКБК = "18210102080011000110";
			КонецЕсли;	
			СтрокаШаблон = "%1; %2; ТП; МС.%3;0; НС; 
			|НДФЛ по доходам физ. лиц - учредителей доверительного управления, налог - %4 руб. удержан, как налоговый агент по Договорам ДУ. Без НДС";	
			
			ТекстНазначение = СтрШаблон(СтрокаШаблон, СтрокаКБК, РеквизитыПлатежа.ПечОКТМО, МесяцОплаты, Сумма);			
			
		КонецЕсли;
	КонецЕсли;
		
	Возврат ТекстНазначение;
	
КонецФункции	

&НаСервере
Процедура ПечатьЗаявкиНаСервере(РасчетныйСчет, Сумма, ДокументРезультат, РеквизитыПлатежа, НовыйДокумент)
	
	Если НовыйДокумент Тогда 
		ДокументРезультат.Очистить();
	КонецЕсли;	
	
	Если  РеквизитыПлатежа.ДокументОплата.Дата >= Дата(2023, 1, 1) Тогда
		Макет = Обработки.ПечатьЗаявокНаПроплатуНалога.ПолучитьМакет("Макет2023");		
	Иначе
		Макет = Обработки.ПечатьЗаявокНаПроплатуНалога.ПолучитьМакет("Макет");
	КонецЕсли;
	ОбластьЗаявка = Макет.ПолучитьОбласть("Заявка");
	
	ЗаполнитьЗначенияСвойств(ОбластьЗаявка.Параметры, РеквизитыПлатежа); 
		
	ОбластьЗаявка.Параметры.ПечСуммаПроплаты = Сумма;
	ОбластьЗаявка.Параметры.ПечНазначение = СформироватьНазначение(Сумма, РеквизитыПлатежа);
		
	ДокументРезультат.Вывести(ОбластьЗаявка);
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьЗаявки(Команда)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеИспользовать");

	НовыйДокумент = ИСТИНА;
	Для Каждого СтрокаУровень1 из ЭтаФорма.Оплаты.ПолучитьЭлементы() Цикл 
		Для Каждого СтрокаДанных из СтрокаУровень1.ПолучитьЭлементы() Цикл 
			
			Для Каждого ПодчиненнаяСтрока из СтрокаДанных.ПолучитьЭлементы() Цикл 
			
				РеквизитыПлатежа = Новый Структура("СчетДоверительногоУправления, НомерДоговора, ДатаЗаключения, ДокументОплата, ПечДатаПроплаты, ПечПолучатель, ПечИНН, ПечРасчСчет, ПечСубСчет, ПечБИК, ПечБанкПолучателя, ПечКоррСчет, ПечБанк, ПечОКТМО, ВидЗадолженности");
				ЗаполнитьЗначенияСвойств(РеквизитыПлатежа, ПодчиненнаяСтрока);
					
				Если ПодчиненнаяСтрока.ВидЗадолженности <> ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль") Тогда 		
					Прервать;
				Иначе // по юр. лицам отдельная заявка
					ПечатьЗаявкиНаСервере(СтрокаДанных.РасчетныйСчет, СтрокаДанных.Сумма, ТабличныйДокумент, РеквизитыПлатежа, НовыйДокумент);
					НовыйДокумент = ЛОЖЬ;
				КонецЕсли;	
			КонецЦикла;	
			// по физ лицам зявка объединенная
			Если ПодчиненнаяСтрока.ВидЗадолженности <> ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль") Тогда 		
				ПечатьЗаявкиНаСервере(СтрокаДанных.РасчетныйСчет, СтрокаДанных.Сумма, ТабличныйДокумент, РеквизитыПлатежа, НовыйДокумент);
				НовыйДокумент = ЛОЖЬ;
			Конецесли;
		КонецЦикла;
	КонецЦикла;		
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьФорму()
	
	ЭтаФорма.ТабличныйДокумент.Очистить();
	
	ОплатаОбъект = РеквизитФормыВЗначение("Оплаты");
	ОплатаОбъект.Строки.Очистить();
	ЗначениеВРеквизитФормы(ОплатаОбъект, "Оплаты");
	
КонецПроцедуры	

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЭтаФорма.ВидСобытия = "";
	ОчиститьФорму();
			
	ПараметрыФормы = Новый Структура("Организация, Дата", Объект.Организация, Объект.Дата);
	ПараметрыСобытия = ОткрытьФормуМодально("Обработка.ПечатьЗаявокНаПроплатуНалога.Форма.ФормаВыбораСобытия", ПараметрыФормы );
	
	Если ПараметрыСобытия <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыСобытия); 	
		
		Если ЭтаФорма.ВидСобытия = "Оплата налога по расчету НДФЛ" Тогда 
			ЭтаФорма.Элементы.ГруппаДивиденды.Видимость = Ложь;
		ИначеЕсли ЭтаФорма.ВидСобытия = "Оплата налога с дивидендов" Тогда 
			ЭтаФорма.Элементы.ГруппаДивиденды.Видимость = Истина;
		КонецЕсли;;	
		
		ЗаполнитьСведенияОбОплатах();
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не оплаты налога в выбранную дату");
	КонецЕсли;
		
КонецПроцедуры
